#Найдите сумму цифр трехзначного числа.

#*Пример:*

#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)

N = int (input ("vvedite chislo ="))
M = N//100 + N//10%10 + N%10
print (M)